Revit 2015 API
FormatOptions Constructor (UnitSymbolType, DisplayUnitType)
 Creates a new FormatOptions object that represents custom formatting.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
public FormatOptions(
	UnitSymbolType unitSymbol,
	DisplayUnitType displayUnit
)
Visual Basic
Public Sub New ( _
	unitSymbol As UnitSymbolType, _
	displayUnit As DisplayUnitType _
)
Visual C++
public:
FormatOptions(
	UnitSymbolType unitSymbol,
	DisplayUnitType displayUnit
)
Parameters
unitSymbol
Type: Autodesk.Revit.DB.UnitSymbolType
 The unit symbol.
displayUnit
Type: Autodesk.Revit.DB.DisplayUnitType
 The display unit.
Remarks
 This constructor is equivalent to FormatOptions(DisplayUnitType, UnitSymbolType).
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  displayUnit is an invalid display unit. See UnitUtils.IsValidDisplayUnit(DisplayUnitType) and UnitUtils.GetValidDisplayUnits(). -or- unitSymbol is not a valid unit symbol for displayUnit.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
FormatOptions Class
FormatOptions Overload
Autodesk.Revit.DB Namespace